using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using Cyriller.Model;

namespace Cyriller
{
    public partial class CyrWord
    {
        protected CyrResult DeclineNoun1()
        {
            CyrResult r = new CyrResult();

            r[1] = w;

            if (w.RegexHasMatches("([пмтбвдзмлнрсфц])([а])$"))
            {
                r[2] = w.ReplaceRegex("([пмтбвдзмлнрсфц])([а])$", "$1ы");
            }
            else
            {
                r[2] = w.ReplaceRegex("([ая])$", "и");
            }

            if (w.RegexHasMatches("(ия)$"))
            {
                r[3] = w.ReplaceRegex("(ия)$", "ии");
            }
            else
            {
                r[3] = w.ReplaceRegex("([ая])$", "е");
            }

            if (w.RegexHasMatches("(а)$"))
            {
                r[4] = w.ReplaceRegex("([а])$", "у");
            }
            else
            {
                r[4] = w.ReplaceRegex("([я])$", "ю");
            }

            if (w.RegexHasMatches("жа$"))
            {
                string[] zhoy = new string[] { "баржа", "вожжа", "Гаджа", "г-жа", "госпожа", "дежа", "межа", "обжа", "паранджа", "ржа", "ходжа", "саджа", "ханжа", "Хижа" };

                if (zhoy.Contains(w))
                {
                    r[5] = w.ReplaceRegex("а$", "ой");
                }
                else
                {
                    r[5] = w.ReplaceRegex("а$", "ей");
                }
            }
            else if (w.RegexHasMatches("[шщц]а$"))
            {
                r[5] = w.ReplaceRegex("а$", "ей");
            }
            else if (w.RegexHasMatches("ия$") || w.RegexHasMatches("рня$"))
            {
                string[] yoy = new string[] { "лития", "паремия", "судия", "пятерня", "шоферня", "шестерня", "четверня", "стерня" };

                if (yoy.Contains(w))
                {
                    r[5] = w.ReplaceRegex("я$", "ёй");
                }
                else
                {
                    r[5] = w.ReplaceRegex("я$", "ей");
                }
            }
            else if (w.RegexHasMatches("а$"))
            {
                r[5] = w.ReplaceRegex("а$", "ой");
            }
            else
            {
                string[] yoy = new string[] { "бадья", "беготня", "болтовня", "бормотня", "брехня", "броня", "брызготня", "вахня", "верея", "визготня", "возня", "воркотня", "ворожея", "галиматья", "головня", "грызня", "дерготня", "долбня", "дрызготня", "ектенья", "епитимья", "жнея", "западня", "заря", "земля", "змея", "квашня", "кисея", "клешня", "колея", "конопля", "копотня", "культя", "курья", "кутья", "ладья", "лыжня", "мазня", "малышня", "манатья", "матросня", "мерея", "мотня", "мурья", "неровня", "ноздря", "палея", "паремья", "пачкотня", "петля", "пешня", "пискля", "пискотня", "плачея", "плескотня", "полынья", "попадья", "простыня", "размазня", "ребятня", "резня", "ровня", "родня", "ругня", "руготня", "рыбозмея", "свинья", "семья", "скамья", "скуфья", "словопря", "солдатня", "солея", "сопля", "спорынья", "статья", "стезя", "стрекотня", "струя", "стряпня", "стукотня", "ступня", "судья", "суетня", "сулея", "тавлея", "тафья", "тля", "толкотня", "толчея", "топотня", "трепотня", "трескотня", "тулья", "фигня", "фря", "харатья", "хвастня", "хлопотня", "хохотня", "цепня", "чешуя", "шаркотня", "швея", "шемая", "шепотня", "шлея", "щелкотня", "ячея" };

                if (yoy.Contains(w))
                {
                    r[5] = w.ReplaceRegex("я$", "ёй");
                }
                else
                {
                    r[5] = w.ReplaceRegex("я$", "ей");
                }
            }

            if (w.RegexHasMatches("(ия)$"))
            {
                r[6] = w.ReplaceRegex("(ия)$", "ии");
            }
            else
            {
                r[6] = w.ReplaceRegex("([ая])$", "е");
            }

            return r;
        }
    }
}
